Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC4A.xml
        <module name="TRNG" id="I7643" version="1.0.3">
          <instance name="TRNG">
            <register-group name="TRNG" name-in-module="TRNG" address-space="base" offset="0x40068000"/>
          </instance>
        </module>
        <module name="TWIM" id="I7535" version="1.2.0">
          <instance name="TWIM0">
            <register-group name="TWIM0" name-in-module="TWIM" address-space="base" offset="0x40018000"/>
          </instance>
          <instance name="TWIM1">
            <register-group name="TWIM1" name-in-module="TWIM" address-space="base" offset="0x4001C000"/>
          </instance>
          <instance name="TWIM2">
            <register-group name="TWIM2" name-in-module="TWIM" address-space="base" offset="0x40078000"/>
          </instance>
          <instance name="TWIM3">
            <register-group name="TWIM3" name-in-module="TWIM" address-space="base" offset="0x4007C000"/>
          </instance>
        </module>
        <module name="TWIMS" version="1.0.0">
          <instance name="TWIMS0">
            <signals>
              <signal group="TWCK" function="B" pad="PA24"/>
              <signal group="TWD" function="B" pad="PA23"/>
            </signals>
          </instance>
          <instance name="TWIMS1">
            <signals>
              <signal group="TWCK" function="A" pad="PB01"/>
              <signal group="TWD" function="A" pad="PB00"/>
            </signals>
          </instance>
          <instance name="TWIMS2">
            <signals>
              <signal group="TWCK" function="E" pad="PA22"/>
              <signal group="TWD" function="E" pad="PA21"/>
            </signals>
          </instance>
          <instance name="TWIMS3">
            <signals>
              <signal group="TWCK" function="C" pad="PB15"/>
              <signal group="TWD" function="C" pad="PB14"/>
            </signals>
          </instance>
        </module>
        <module name="TWIS" id="I7537" version="1.4.0">
          <instance name="TWIS0">
            <register-group name="TWIS0" name-in-module="TWIS" address-space="base" offset="0x40018400"/>
          </instance>
          <instance name="TWIS1">
            <register-group name="TWIS1" name-in-module="TWIS" address-space="base" offset="0x4001C400"/>
          </instance>
        </module>
        <module name="USART" id="I7601" version="6.0.2.1">
          <instance name="USART0">
            <register-group name="USART0" name-in-module="USART" address-space="base" offset="0x40024000"/>
            <signals>
              <signal group="CLK" function="B" pad="PA04"/>
              <signal group="CLK" function="B" pad="PC00"/>
              <signal group="CLK" function="A" pad="PA10"/>
              <signal group="CLK" function="A" pad="PB13"/>
              <signal group="CTS" function="B" pad="PC02"/>
              <signal group="CTS" function="A" pad="PA09"/>
              <signal group="CTS" function="A" pad="PB11"/>
              <signal group="RTS" function="B" pad="PA06"/>
              <signal group="RTS" function="B" pad="PC01"/>
              <signal group="RTS" function="A" pad="PA08"/>
              <signal group="RTS" function="A" pad="PB12"/>
              <signal group="RXD" function="C" pad="PC02"/>
              <signal group="RXD" function="B" pad="PA05"/>
              <signal group="RXD" function="B" pad="PB00"/>
              <signal group="RXD" function="A" pad="PA11"/>
              <signal group="RXD" function="A" pad="PB14"/>
              <signal group="TXD" function="C" pad="PC03"/>
              <signal group="TXD" function="B" pad="PA07"/>
              <signal group="TXD" function="B" pad="PB01"/>
              <signal group="TXD" function="A" pad="PA12"/>
              <signal group="TXD" function="A" pad="PB15"/>
            </signals>
            <parameters>
              <param name="CLK_DIV" value="8"/>
            </parameters>
          </instance>
          <instance name="USART1">
            <register-group name="USART1" name-in-module="USART" address-space="base" offset="0x40028000"/>
            <signals>
              <signal group="CLK" function="B" pad="PB03"/>
              <signal group="CLK" function="A" pad="PA14"/>
              <signal group="CLK" function="A" pad="PC25"/>
              <signal group="CTS" function="B" pad="PA21"/>
              <signal group="RTS" function="B" pad="PB02"/>
              <signal group="RTS" function="A" pad="PA13"/>
              <signal group="RTS" function="A" pad="PC24"/>
              <signal group="RXD" function="B" pad="PB04"/>
              <signal group="RXD" function="A" pad="PA15"/>
              <signal group="RXD" function="A" pad="PC26"/>
              <signal group="TXD" function="B" pad="PB05"/>
              <signal group="TXD" function="A" pad="PA16"/>
              <signal group="TXD" function="A" pad="PC27"/>
            </signals>
            <parameters>
              <param name="CLK_DIV" value="8"/>
            </parameters>
          </instance>
          <instance name="USART2">
            <register-group name="USART2" name-in-module="USART" address-space="base" offset="0x4002C000"/>
            <signals>
              <signal group="CLK" function="B" pad="PC08"/>
              <signal group="CLK" function="A" pad="PA18"/>
              <signal group="CTS" function="E" pad="PC08"/>
              <signal group="CTS" function="B" pad="PA22"/>
              <signal group="RTS" function="B" pad="PC07"/>
              <signal group="RTS" function="A" pad="PA17"/>
              <signal group="RXD" function="B" pad="PA25"/>
              <signal group="RXD" function="B" pad="PC11"/>
              <signal group="RXD" function="A" pad="PA19"/>
              <signal group="TXD" function="B" pad="PA26"/>
              <signal group="TXD" function="B" pad="PC12"/>
              <signal group="TXD" function="A" pad="PA20"/>
            </signals>
            <parameters>
              <param name="CLK_DIV" value="8"/>
            </parameters>
          </instance>
          <instance name="USART3">
            <register-group name="USART3" name-in-module="USART" address-space="base" offset="0x40030000"/>
            <signals>
              <signal group="CLK" function="E" pad="PA29"/>
              <signal group="CLK" function="B" pad="PC14"/>
              <signal group="CLK" function="A" pad="PB08"/>
              <signal group="CLK" function="A" pad="PC31"/>
              <signal group="CTS" function="E" pad="PA28"/>
              <signal group="CTS" function="A" pad="PB07"/>
              <signal group="RTS" function="E" pad="PA27"/>
              <signal group="RTS" function="B" pad="PC13"/>
              <signal group="RTS" function="A" pad="PB06"/>
              <signal group="RTS" function="A" pad="PC30"/>
              <signal group="RXD" function="E" pad="PA30"/>
              <signal group="RXD" function="B" pad="PC09"/>
              <signal group="RXD" function="A" pad="PB09"/>
              <signal group="RXD" function="A" pad="PC28"/>
              <signal group="TXD" function="E" pad="PA31"/>
              <signal group="TXD" function="B" pad="PC10"/>
              <signal group="TXD" function="A" pad="PB10"/>
              <signal group="TXD" function="A" pad="PC29"/>
            </signals>
            <parameters>
              <param name="CLK_DIV" value="8"/>
            </parameters>
          </instance>
        </module>
