Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC4A.xml
        <register name="CHMX" offset="0x100" rw="RW" size="4" count="19" count-param="TRIGOUT_BITS" initval="0x00000000" caption="Channel Multiplexer">
          <bitfield name="EVMX" caption="Event Multiplexer" mask="0x3F" values="PEVC_CHMX__EVMX"/>
          <bitfield name="SMX" caption="Software Event Multiplexer" mask="0x100" values="PEVC_CHMX__SMX"/>
        </register>
        <register name="EVS" offset="0x200" rw="RW" size="4" count="31" count-param="EVIN_BITS" initval="0x00000000" caption="Event Shaper">
          <bitfield name="EN" caption="Event Shaper Enable" mask="0x1" values="PEVC_EVS__EN"/>
          <bitfield name="IGFR" caption="Input Glitch Filter Rise" mask="0x10000" values="PEVC_EVS__IGFR"/>
          <bitfield name="IGFF" caption="Input Glitch Filter Fall" mask="0x20000" values="PEVC_EVS__IGFF"/>
          <bitfield name="IGFON" caption="Input Glitch Filter Status" mask="0x40000"/>
        </register>
        <register name="IGFDR" offset="0x300" rw="RW" size="4" initval="0x00000000" caption="Input Glitch Filter Divider Register">
          <bitfield name="IGFDR" caption="Input Glitch Filter Divider Register" mask="0xF"/>
        </register>
        <register name="PARAMETER" offset="0x3f8" rw="R" size="4" initval="0x14061824" caption="Parameter">
          <bitfield name="IGF_COUNT" caption="Number of Input Glitch Filters" mask="0xFF"/>
          <bitfield name="EVS_COUNT" caption="Number of Event Shapers" mask="0xFF00"/>
          <bitfield name="EVIN" caption="Number of Event Inputs / Generators" mask="0xFF0000"/>
          <bitfield name="TRIGOUT" caption="Number of Trigger Outputs / Channels / Users" mask="0xFF000000"/>
        </register>
        <register name="VERSION" offset="0x3fc" rw="R" size="4" initval="0x00000200" caption="Version">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
      <value-group name="PEVC_CHSR__CHS">
        <value name="0" caption="Channel j Disabled" value="0"/>
        <value name="1" caption="Channel j Enabled" value="1"/>
      </value-group>
      <value-group name="PEVC_CHER__CHE">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Enable Channel j" value="1"/>
      </value-group>
      <value-group name="PEVC_CHDR__CHD">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Disable Channel j" value="1"/>
      </value-group>
      <value-group name="PEVC_SEV__SEV">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="CPU forces software event to channel j" value="1"/>
      </value-group>
      <value-group name="PEVC_BUSY__BUSY">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Channel j or User j is Busy" value="1"/>
      </value-group>
      <value-group name="PEVC_TRIER__TRIE">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Enable Trigger j Interrupt" value="1"/>
      </value-group>
      <value-group name="PEVC_TRIDR__TRID">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Disable Trigger j Interrupt" value="1"/>
      </value-group>
      <value-group name="PEVC_TRIMR__TRIM">
        <value name="0" caption="Trigger j Interrupt Disabled" value="0"/>
        <value name="1" caption="Trigger j Interrupt Enabled" value="1"/>
      </value-group>
      <value-group name="PEVC_TRSR__TRS">
        <value name="0" caption="Channel j did not send out an Event in the past" value="0"/>
        <value name="1" caption="Channel j did send out an Event in the past" value="1"/>
      </value-group>
      <value-group name="PEVC_TRSCR__TRSC">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Clear TRSR[j]" value="1"/>
      </value-group>
      <value-group name="PEVC_OVIER__OVIE">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Enable Overrun Interrupt for Channel j" value="1"/>
      </value-group>
      <value-group name="PEVC_OVIDR__OVID">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Enable Overrun Interrupt for Channel j" value="1"/>
      </value-group>
      <value-group name="PEVC_OVIMR__OVIM">
        <value name="0" caption="Overrun Interrupt for Channel j Disabled" value="0"/>
        <value name="1" caption="Overrun Interrupt for Channel j Enabled" value="1"/>
      </value-group>
      <value-group name="PEVC_OVSR__OVS">
        <value name="0" caption="No Overrun occured on Channel j" value="0"/>
        <value name="1" caption="Overrun occured on Channel j" value="1"/>
      </value-group>
      <value-group name="PEVC_OVSCR__OVSC">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Clear Overrun Status Bit j" value="1"/>
      </value-group>
      <value-group name="PEVC_CHMX__EVMX">
        <value name="0x00" caption="Event 0" value="0x00"/>
        <value name="0x01" caption="Event 1" value="0x01"/>
      </value-group>
      <value-group name="PEVC_CHMX__SMX">
        <value name="0" caption="Hardware events" value="0"/>
        <value name="1" caption="Software event" value="1"/>
      </value-group>
      <value-group name="PEVC_EVS__EN">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Event Shaper enable" value="1"/>
      </value-group>
      <value-group name="PEVC_EVS__IGFF">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Input Glitch Filter : a falling edge on event input will raise trigger output" value="1"/>
      </value-group>
      <value-group name="PEVC_EVS__IGFR">
        <value name="0" caption="No Action" value="0"/>
        <value name="1" caption="Input Glitch Filter : a rising edge on event input will raise trigger output" value="1"/>
      </value-group>
    </module>
