Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC4A.xml
      <value-group name="TC_IER__CPCS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the RC Compare Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IER__ETRGS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the External Trigger Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IER__LDRAS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the RA Load Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IER__LDRBS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the RB Load Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IER__LOVRS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the Load Overrun Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IDR__COVFS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the Counter Overflow Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IDR__CPAS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the RA Compare Interrupt (if WAVE:1)." value="1"/>
      </value-group>
      <value-group name="TC_IDR__CPBS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the RB Compare Interrupt (if WAVE:1)." value="1"/>
      </value-group>
      <value-group name="TC_IDR__CPCS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the RC Compare Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IDR__ETRGS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the External Trigger Interrupt." value="1"/>
      </value-group>
      <value-group name="TC_IDR__LDRAS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the RA Load Interrupt (if WAVE:0)." value="1"/>
      </value-group>
      <value-group name="TC_IDR__LDRBS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the RB Load Interrupt (if WAVE:0)." value="1"/>
      </value-group>
      <value-group name="TC_IDR__LOVRS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the Load Overrun Interrupt (if WAVE:0)." value="1"/>
      </value-group>
      <value-group name="TC_IMR__COVFS">
        <value name="0" caption="The Counter Overflow Interrupt is disabled." value="0"/>
        <value name="1" caption="The Counter Overflow Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="TC_IMR__CPAS">
        <value name="0" caption="The RA Compare Interrupt is disabled." value="0"/>
        <value name="1" caption="The RA Compare Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="TC_IMR__CPBS">
        <value name="0" caption="The RB Compare Interrupt is disabled." value="0"/>
        <value name="1" caption="The RB Compare Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="TC_IMR__CPCS">
        <value name="0" caption="The RC Compare Interrupt is disabled." value="0"/>
        <value name="1" caption="The RC Compare Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="TC_IMR__ETRGS">
        <value name="0" caption="The External Trigger Interrupt is disabled." value="0"/>
        <value name="1" caption="The External Trigger Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="TC_IMR__LDRAS">
        <value name="0" caption="The Load RA Interrupt is disabled." value="0"/>
        <value name="1" caption="The Load RA Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="TC_IMR__LDRBS">
        <value name="0" caption="The Load RB Interrupt is disabled." value="0"/>
        <value name="1" caption="The Load RB Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="TC_IMR__LOVRS">
        <value name="0" caption="The Load Overrun Interrupt is disabled." value="0"/>
        <value name="1" caption="The Load Overrun Interrupt is enabled." value="1"/>
      </value-group>
      <value-group name="TC_BCR__SYNC">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Asserts the SYNC signal which generates a software trigger simultaneously for each of the channels." value="1"/>
      </value-group>
      <value-group name="TC_BMR__TC0XC0S">
        <value name="TCLK0" caption="Select TCLK0 as clock signal 0." value="0"/>
        <value name="NO_CLK" caption="Select no clock as clock signal 0." value="1"/>
        <value name="TIOA1" caption="Select TIOA1 as clock signal 0." value="2"/>
        <value name="TIOA2" caption="Select TIOA2 as clock signal 0." value="3"/>
      </value-group>
      <value-group name="TC_BMR__TC1XC1S">
        <value name="TCLK1" caption="Select TCLK1 as clock signal 1." value="0"/>
        <value name="NO_CLK" caption="Select no clock as clock signal 1." value="1"/>
        <value name="TIOA0" caption="Select TIOA0 as clock signal 1." value="2"/>
        <value name="TIOA2" caption="Select TIOA2 as clock signal 1." value="3"/>
      </value-group>
      <value-group name="TC_BMR__TC2XC2S">
        <value name="TCLK2" caption="Select TCLK2 as clock signal 2." value="0"/>
        <value name="NO_CLK" caption="Select no clock as clock signal 2." value="1"/>
        <value name="TIOA0" caption="Select TIOA0 as clock signal 2." value="2"/>
        <value name="TIOA1" caption="Select TIOA1 as clock signal 2." value="3"/>
      </value-group>
    </module>
    <module name="TRNG" id="I7643" version="1.0.3" caption="True Random Number Generator">
      <register-group name="TRNG" caption="True Random Number Generator">
        <register name="CR" offset="0x0" rw="W" size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="ENABLE" caption="Enables the TRNG to provide random values" mask="0x1"/>
          <bitfield name="KEY" caption="Security Key" mask="0xFFFFFF00"/>
        </register>
        <register name="IER" offset="0x10" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="DATRDY" caption="Data Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="IDR" offset="0x14" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="DATRDY" caption="Data Ready Interrupt Disable" mask="0x1"/>
        </register>
        <register name="IMR" offset="0x18" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="DATRDY" caption="Data Ready Interrupt Mask" mask="0x1"/>
        </register>
        <register name="ISR" offset="0x1c" rw="R" size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="DATRDY" caption="Data Ready Interrupt Status" mask="0x1"/>
        </register>
