Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC4A.xml
        <register name="UECON7SET" offset="0x20c" rw="W" size="4" initval="0x00000000" caption="Endpoint Control Set Register">
          <bitfield name="TXINES" caption="TXINE Set" mask="0x1"/>
          <bitfield name="RXOUTES" caption="RXOUTE Set" mask="0x2"/>
          <bitfield name="RXSTPES" caption="RXSTPE Set" mask="0x4"/>
          <bitfield name="NAKOUTES" caption="NAKOUTE Set" mask="0x8"/>
          <bitfield name="NAKINES" caption="NAKINE Set" mask="0x10"/>
          <bitfield name="STALLEDES" caption="STALLEDE Set" mask="0x40"/>
          <bitfield name="NREPLYS" caption="NREPLY Set" mask="0x100"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x800"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="KILLBKS" caption="KILLBK Set" mask="0x2000"/>
          <bitfield name="NYETDISS" caption="NYETDIS Set" mask="0x20000"/>
          <bitfield name="RSTDTS" caption="RSTDT Set" mask="0x40000"/>
          <bitfield name="STALLRQS" caption="STALLRQ Set" mask="0x80000"/>
          <bitfield name="BUSY0S" caption="BUSY0 Set" mask="0x1000000"/>
          <bitfield name="BUSY1S" caption="BUSY1 Set" mask="0x2000000"/>
        </register>
        <register name="UECON0CLR" offset="0x220" rw="W" size="4" initval="0x00000000" caption="Endpoint Control Clear Register">
          <bitfield name="TXINEC" caption="TXINE Clear" mask="0x1"/>
          <bitfield name="RXOUTEC" caption="RXOUTE Clear" mask="0x2"/>
          <bitfield name="RXSTPEC" caption="RXSTPE Clear" mask="0x4"/>
          <bitfield name="NAKOUTEC" caption="NAKOUTE Clear" mask="0x8"/>
          <bitfield name="NAKINEC" caption="NAKINE Clear" mask="0x10"/>
          <bitfield name="STALLEDEC" caption="STALLEDE Clear" mask="0x40"/>
          <bitfield name="NREPLYC" caption="NREPLY Clear" mask="0x100"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x800"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="NYETDISC" caption="NYETDIS Clear" mask="0x20000"/>
          <bitfield name="STALLRQC" caption="STALLRQ Clear" mask="0x80000"/>
          <bitfield name="BUSY0C" caption="BUSY0 Clear" mask="0x1000000"/>
          <bitfield name="BUSY1C" caption="BUSY1 Clear" mask="0x2000000"/>
        </register>
        <register name="UECON1CLR" offset="0x224" rw="W" size="4" initval="0x00000000" caption="TXINE Clear">
          <bitfield name="TXINEC" caption="TXINE Clear" mask="0x1"/>
          <bitfield name="RXOUTEC" caption="RXOUTE Clear" mask="0x2"/>
          <bitfield name="RXSTPEC" caption="RXOUTE Clear" mask="0x4"/>
          <bitfield name="NAKOUTEC" caption="NAKOUTE Clear" mask="0x8"/>
          <bitfield name="NAKINEC" caption="NAKINE Clear" mask="0x10"/>
          <bitfield name="STALLEDEC" caption="RXSTPE Clear" mask="0x40"/>
          <bitfield name="NREPLYC" caption="NREPLY Clear" mask="0x100"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x800"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="NYETDISC" caption="NYETDIS Clear" mask="0x20000"/>
          <bitfield name="STALLRQC" caption="STALLEDE Clear" mask="0x80000"/>
          <bitfield name="BUSY0C" caption="BUSY0 Clear" mask="0x1000000"/>
          <bitfield name="BUSY1C" caption="BUSY1 Clear" mask="0x2000000"/>
        </register>
        <register name="UECON2CLR" offset="0x228" rw="W" size="4" initval="0x00000000" caption="TXINE Clear">
          <bitfield name="TXINEC" caption="TXINE Clear" mask="0x1"/>
          <bitfield name="RXOUTEC" caption="RXOUTE Clear" mask="0x2"/>
          <bitfield name="RXSTPEC" caption="RXOUTE Clear" mask="0x4"/>
          <bitfield name="NAKOUTEC" caption="NAKOUTE Clear" mask="0x8"/>
          <bitfield name="NAKINEC" caption="NAKINE Clear" mask="0x10"/>
          <bitfield name="STALLEDEC" caption="RXSTPE Clear" mask="0x40"/>
          <bitfield name="NREPLYC" caption="NREPLY Clear" mask="0x100"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x800"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="NYETDISC" caption="NYETDIS Clear" mask="0x20000"/>
          <bitfield name="STALLRQC" caption="STALLEDE Clear" mask="0x80000"/>
          <bitfield name="BUSY0C" caption="BUSY0 Clear" mask="0x1000000"/>
          <bitfield name="BUSY1C" caption="BUSY1 Clear" mask="0x2000000"/>
        </register>
        <register name="UECON3CLR" offset="0x22c" rw="W" size="4" initval="0x00000000" caption="TXINE Clear">
          <bitfield name="TXINEC" caption="TXINE Clear" mask="0x1"/>
          <bitfield name="RXOUTEC" caption="RXOUTE Clear" mask="0x2"/>
          <bitfield name="RXSTPEC" caption="RXOUTE Clear" mask="0x4"/>
          <bitfield name="NAKOUTEC" caption="NAKOUTE Clear" mask="0x8"/>
          <bitfield name="NAKINEC" caption="NAKINE Clear" mask="0x10"/>
          <bitfield name="STALLEDEC" caption="RXSTPE Clear" mask="0x40"/>
          <bitfield name="NREPLYC" caption="NREPLY Clear" mask="0x100"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x800"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="NYETDISC" caption="NYETDIS Clear" mask="0x20000"/>
          <bitfield name="STALLRQC" caption="STALLEDE Clear" mask="0x80000"/>
          <bitfield name="BUSY0C" caption="BUSY0 Clear" mask="0x1000000"/>
          <bitfield name="BUSY1C" caption="BUSY1 Clear" mask="0x2000000"/>
        </register>
        <register name="UECON4CLR" offset="0x230" rw="W" size="4" initval="0x00000000" caption="TXINE Clear">
          <bitfield name="TXINEC" caption="TXINE Clear" mask="0x1"/>
          <bitfield name="RXOUTEC" caption="RXOUTE Clear" mask="0x2"/>
          <bitfield name="RXSTPEC" caption="RXOUTE Clear" mask="0x4"/>
          <bitfield name="NAKOUTEC" caption="NAKOUTE Clear" mask="0x8"/>
          <bitfield name="NAKINEC" caption="NAKINE Clear" mask="0x10"/>
          <bitfield name="STALLEDEC" caption="RXSTPE Clear" mask="0x40"/>
          <bitfield name="NREPLYC" caption="NREPLY Clear" mask="0x100"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x800"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="NYETDISC" caption="NYETDIS Clear" mask="0x20000"/>
          <bitfield name="STALLRQC" caption="STALLEDE Clear" mask="0x80000"/>
          <bitfield name="BUSY0C" caption="BUSY0 Clear" mask="0x1000000"/>
          <bitfield name="BUSY1C" caption="BUSY1 Clear" mask="0x2000000"/>
        </register>
        <register name="UECON5CLR" offset="0x234" rw="W" size="4" initval="0x00000000" caption="TXINE Clear">
          <bitfield name="TXINEC" caption="TXINE Clear" mask="0x1"/>
          <bitfield name="RXOUTEC" caption="RXOUTE Clear" mask="0x2"/>
          <bitfield name="RXSTPEC" caption="RXOUTE Clear" mask="0x4"/>
          <bitfield name="NAKOUTEC" caption="NAKOUTE Clear" mask="0x8"/>
          <bitfield name="NAKINEC" caption="NAKINE Clear" mask="0x10"/>
          <bitfield name="STALLEDEC" caption="RXSTPE Clear" mask="0x40"/>
          <bitfield name="NREPLYC" caption="NREPLY Clear" mask="0x100"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x800"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="NYETDISC" caption="NYETDIS Clear" mask="0x20000"/>
          <bitfield name="STALLRQC" caption="STALLEDE Clear" mask="0x80000"/>
          <bitfield name="BUSY0C" caption="BUSY0 Clear" mask="0x1000000"/>
          <bitfield name="BUSY1C" caption="BUSY1 Clear" mask="0x2000000"/>
        </register>
        <register name="UECON6CLR" offset="0x238" rw="W" size="4" initval="0x00000000" caption="TXINE Clear">
          <bitfield name="TXINEC" caption="TXINE Clear" mask="0x1"/>
          <bitfield name="RXOUTEC" caption="RXOUTE Clear" mask="0x2"/>
          <bitfield name="RXSTPEC" caption="RXOUTE Clear" mask="0x4"/>
          <bitfield name="NAKOUTEC" caption="NAKOUTE Clear" mask="0x8"/>
          <bitfield name="NAKINEC" caption="NAKINE Clear" mask="0x10"/>
          <bitfield name="STALLEDEC" caption="RXSTPE Clear" mask="0x40"/>
          <bitfield name="NREPLYC" caption="NREPLY Clear" mask="0x100"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x800"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="NYETDISC" caption="NYETDIS Clear" mask="0x20000"/>
          <bitfield name="STALLRQC" caption="STALLEDE Clear" mask="0x80000"/>
          <bitfield name="BUSY0C" caption="BUSY0 Clear" mask="0x1000000"/>
          <bitfield name="BUSY1C" caption="BUSY1 Clear" mask="0x2000000"/>
        </register>
        <register name="UECON7CLR" offset="0x23c" rw="W" size="4" initval="0x00000000" caption="TXINE Clear">
          <bitfield name="TXINEC" caption="TXINE Clear" mask="0x1"/>
          <bitfield name="RXOUTEC" caption="RXOUTE Clear" mask="0x2"/>
          <bitfield name="RXSTPEC" caption="RXOUTE Clear" mask="0x4"/>
          <bitfield name="NAKOUTEC" caption="NAKOUTE Clear" mask="0x8"/>
          <bitfield name="NAKINEC" caption="NAKINE Clear" mask="0x10"/>
          <bitfield name="STALLEDEC" caption="RXSTPE Clear" mask="0x40"/>
          <bitfield name="NREPLYC" caption="NREPLY Clear" mask="0x100"/>
          <bitfield name="RAMACEREC" caption="RAMACERE Clear" mask="0x800"/>
          <bitfield name="NBUSYBKEC" caption="NBUSYBKE Clear" mask="0x1000"/>
          <bitfield name="FIFOCONC" caption="FIFOCON Clear" mask="0x4000"/>
          <bitfield name="NYETDISC" caption="NYETDIS Clear" mask="0x20000"/>
          <bitfield name="STALLRQC" caption="STALLEDE Clear" mask="0x80000"/>
          <bitfield name="BUSY0C" caption="BUSY0 Clear" mask="0x1000000"/>
          <bitfield name="BUSY1C" caption="BUSY1 Clear" mask="0x2000000"/>
        </register>
        <register name="UHCON" offset="0x400" rw="RW" size="4" initval="0x00000000" caption="Host General Control Register">
          <bitfield name="SOFE" caption="SOF Enable" mask="0x100"/>
          <bitfield name="RESET" caption="Send USB Reset" mask="0x200"/>
          <bitfield name="RESUME" caption="Send USB Resume" mask="0x400"/>
          <bitfield name="SPDCONF" caption="Speed Configuration" mask="0x3000"/>
          <bitfield name="TSTJ" caption="Test J" mask="0x10000"/>
          <bitfield name="TSTK" caption="Test K" mask="0x20000"/>
        </register>
        <register name="UHINT" offset="0x404" rw="R" size="4" initval="0x00000000" caption="Host Global Interrupt Register">
          <bitfield name="DCONNI" caption="Device Connection Interrupt" mask="0x1"/>
          <bitfield name="DDISCI" caption="Device Disconnection Interrupt" mask="0x2"/>
          <bitfield name="RSTI" caption="USB Reset Sent Interrupt" mask="0x4"/>
          <bitfield name="RSMEDI" caption="Downstream Resume Sent Interrupt" mask="0x8"/>
          <bitfield name="RXRSMI" caption="Upstream Resume Received Interrupt" mask="0x10"/>
          <bitfield name="HSOFI" caption="Host SOF Interrupt" mask="0x20"/>
          <bitfield name="HWUPI" caption="Host Wake-Up Interrupt" mask="0x40"/>
          <bitfield name="P0INT" caption="Pipe 0 Interrupt" mask="0x100"/>
          <bitfield name="P1INT" caption="Pipe 1 Interrupt" mask="0x200"/>
          <bitfield name="P2INT" caption="Pipe 2 Interrupt" mask="0x400"/>
          <bitfield name="P3INT" caption="Pipe 3 Interrupt" mask="0x800"/>
          <bitfield name="P4INT" caption="Pipe 4 Interrupt" mask="0x1000"/>
          <bitfield name="P5INT" caption="Pipe 5 Interrupt" mask="0x2000"/>
          <bitfield name="P6INT" caption="Pipe 6 Interrupt" mask="0x4000"/>
        </register>
        <register name="UHINTCLR" offset="0x408" rw="W" size="4" initval="0x00000000" caption="Host Global Interrrupt Clear Register">
          <bitfield name="DCONNIC" caption="DCONNI Clear" mask="0x1"/>
          <bitfield name="DDISCIC" caption="DDISCI Clear" mask="0x2"/>
          <bitfield name="RSTIC" caption="RSTI Clear" mask="0x4"/>
          <bitfield name="RSMEDIC" caption="RSMEDI Clear" mask="0x8"/>
          <bitfield name="RXRSMIC" caption="RXRSMI Clear" mask="0x10"/>
          <bitfield name="HSOFIC" caption="HSOFI Clear" mask="0x20"/>
          <bitfield name="HWUPIC" caption="HWUPI Clear" mask="0x40"/>
        </register>
        <register name="UHINTSET" offset="0x40c" rw="W" size="4" initval="0x00000000" caption="Host Global Interrupt Set Register">
          <bitfield name="DCONNIS" caption="DCONNI Set" mask="0x1"/>
          <bitfield name="DDISCIS" caption="DDISCI Set" mask="0x2"/>
          <bitfield name="RSTIS" caption="RSTI Set" mask="0x4"/>
          <bitfield name="RSMEDIS" caption="RSMEDI Set" mask="0x8"/>
          <bitfield name="RXRSMIS" caption="RXRSMI Set" mask="0x10"/>
          <bitfield name="HSOFIS" caption="HSOFI Set" mask="0x20"/>
          <bitfield name="HWUPIS" caption="HWUPI Set" mask="0x40"/>
        </register>
